Revit 2026 API

# CurveArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
CurveArrayIterator()
```
```fsharp
new : unit -> CurveArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

CurveArrayIterator Class

Autodesk.Revit.DB Namespace